espressif/esp-idf/components/soc/esp32p4/include/soc/hp_apm_struct.h
/** Type of region10_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region10_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region10_r0_pms_x:1;
        /** region10_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region10_r0_pms_w:1;
        /** region10_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region10_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region10_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region10_r1_pms_x:1;
        /** region10_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region10_r1_pms_w:1;
        /** region10_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region10_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region10_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region10_r2_pms_x:1;
        /** region10_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region10_r2_pms_w:1;
        /** region10_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region10_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region10_pms_attr_reg_t;

/** Type of region11_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region11_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region11_r0_pms_x:1;
        /** region11_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region11_r0_pms_w:1;
        /** region11_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region11_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region11_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region11_r1_pms_x:1;
        /** region11_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region11_r1_pms_w:1;
        /** region11_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region11_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region11_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region11_r2_pms_x:1;
        /** region11_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region11_r2_pms_w:1;
        /** region11_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region11_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region11_pms_attr_reg_t;

/** Type of region12_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region12_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region12_r0_pms_x:1;
        /** region12_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region12_r0_pms_w:1;
        /** region12_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region12_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region12_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region12_r1_pms_x:1;
        /** region12_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region12_r1_pms_w:1;
        /** region12_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region12_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region12_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region12_r2_pms_x:1;
        /** region12_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region12_r2_pms_w:1;
        /** region12_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region12_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region12_pms_attr_reg_t;

/** Type of region13_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region13_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region13_r0_pms_x:1;
        /** region13_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region13_r0_pms_w:1;
        /** region13_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region13_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region13_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region13_r1_pms_x:1;
        /** region13_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region13_r1_pms_w:1;
        /** region13_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region13_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region13_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region13_r2_pms_x:1;
        /** region13_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region13_r2_pms_w:1;
        /** region13_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region13_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region13_pms_attr_reg_t;

/** Type of region14_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region14_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region14_r0_pms_x:1;
        /** region14_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region14_r0_pms_w:1;
        /** region14_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region14_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region14_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region14_r1_pms_x:1;
        /** region14_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region14_r1_pms_w:1;
        /** region14_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region14_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region14_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region14_r2_pms_x:1;
        /** region14_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region14_r2_pms_w:1;
        /** region14_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region14_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region14_pms_attr_reg_t;

/** Type of region15_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region15_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region15_r0_pms_x:1;
        /** region15_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region15_r0_pms_w:1;
        /** region15_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region15_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region15_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region15_r1_pms_x:1;
        /** region15_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region15_r1_pms_w:1;
        /** region15_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region15_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region15_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region15_r2_pms_x:1;
        /** region15_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region15_r2_pms_w:1;
        /** region15_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region15_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region15_pms_attr_reg_t;


