espressif/esp-idf/components/soc/esp32p4/include/soc/hp_apm_struct.h
/** Group: M3 exception_info0 register */
/** Type of m3_exception_info0 register
 *  M3 exception_info0 register
 */
typedef union {
    struct {
        /** m3_exception_region : RO; bitpos: [15:0]; default: 0;
         *  Exception region
         */
        uint32_t m3_exception_region:16;
        /** m3_exception_mode : RO; bitpos: [17:16]; default: 0;
         *  Exception mode
         */
        uint32_t m3_exception_mode:2;
        /** m3_exception_id : RO; bitpos: [22:18]; default: 0;
         *  Exception id information
         */
        uint32_t m3_exception_id:5;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} hp_apm_m3_exception_info0_reg_t;


/** Group: M3 exception_info1 register */
/** Type of m3_exception_info1 register
 *  M3 exception_info1 register
 */
typedef union {
    struct {
        /** m3_exception_addr : RO; bitpos: [31:0]; default: 0;
         *  Exception addr
         */
        uint32_t m3_exception_addr:32;
    };
    uint32_t val;
} hp_apm_m3_exception_info1_reg_t;


/** Group: APM interrupt enable register */
/** Type of int_en register
 *  APM interrupt enable register
 */
typedef union {
    struct {
        /** m0_apm_int_en : R/W; bitpos: [0]; default: 0;
         *  APM M0 interrupt enable
         */
        uint32_t m0_apm_int_en:1;
        /** m1_apm_int_en : R/W; bitpos: [1]; default: 0;
         *  APM M1 interrupt enable
         */
        uint32_t m1_apm_int_en:1;
        /** m2_apm_int_en : R/W; bitpos: [2]; default: 0;
         *  APM M2 interrupt enable
         */
        uint32_t m2_apm_int_en:1;
        /** m3_apm_int_en : R/W; bitpos: [3]; default: 0;
         *  APM M3 interrupt enable
         */
        uint32_t m3_apm_int_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_apm_int_en_reg_t;


/** Group: clock gating register */
/** Type of clock_gate register
 *  clock gating register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  reg_clk_en
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_apm_clock_gate_reg_t;


/** Group: Version register */
/** Type of date register
 *  Version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 35672640;
         *  reg_date
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_apm_date_reg_t;


typedef struct hp_apm_dev_t {
    volatile hp_apm_region_filter_en_reg_t region_filter_en;
    volatile hp_apm_region0_addr_start_reg_t region0_addr_start;
    volatile hp_apm_region0_addr_end_reg_t region0_addr_end;
    volatile hp_apm_region0_pms_attr_reg_t region0_pms_attr;
    volatile hp_apm_region1_addr_start_reg_t region1_addr_start;
    volatile hp_apm_region1_addr_end_reg_t region1_addr_end;
    volatile hp_apm_region1_pms_attr_reg_t region1_pms_attr;
    volatile hp_apm_region2_addr_start_reg_t region2_addr_start;
    volatile hp_apm_region2_addr_end_reg_t region2_addr_end;
    volatile hp_apm_region2_pms_attr_reg_t region2_pms_attr;
    volatile hp_apm_region3_addr_start_reg_t region3_addr_start;
    volatile hp_apm_region3_addr_end_reg_t region3_addr_end;
    volatile hp_apm_region3_pms_attr_reg_t region3_pms_attr;
    volatile hp_apm_region4_addr_start_reg_t region4_addr_start;
    volatile hp_apm_region4_addr_end_reg_t region4_addr_end;
    volatile hp_apm_region4_pms_attr_reg_t region4_pms_attr;
    volatile hp_apm_region5_addr_start_reg_t region5_addr_start;
    volatile hp_apm_region5_addr_end_reg_t region5_addr_end;
    volatile hp_apm_region5_pms_attr_reg_t region5_pms_attr;
    volatile hp_apm_region6_addr_start_reg_t region6_addr_start;
    volatile hp_apm_region6_addr_end_reg_t region6_addr_end;
    volatile hp_apm_region6_pms_attr_reg_t region6_pms_attr;
    volatile hp_apm_region7_addr_start_reg_t region7_addr_start;
    volatile hp_apm_region7_addr_end_reg_t region7_addr_end;
    volatile hp_apm_region7_pms_attr_reg_t region7_pms_attr;
    volatile hp_apm_region8_addr_start_reg_t region8_addr_start;
    volatile hp_apm_region8_addr_end_reg_t region8_addr_end;
    volatile hp_apm_region8_pms_attr_reg_t region8_pms_attr;
    volatile hp_apm_region9_addr_start_reg_t region9_addr_start;
    volatile hp_apm_region9_addr_end_reg_t region9_addr_end;
    volatile hp_apm_region9_pms_attr_reg_t region9_pms_attr;
    volatile hp_apm_region10_addr_start_reg_t region10_addr_start;
    volatile hp_apm_region10_addr_end_reg_t region10_addr_end;
    volatile hp_apm_region10_pms_attr_reg_t region10_pms_attr;
    volatile hp_apm_region11_addr_start_reg_t region11_addr_start;
    volatile hp_apm_region11_addr_end_reg_t region11_addr_end;
    volatile hp_apm_region11_pms_attr_reg_t region11_pms_attr;
    volatile hp_apm_region12_addr_start_reg_t region12_addr_start;
    volatile hp_apm_region12_addr_end_reg_t region12_addr_end;
    volatile hp_apm_region12_pms_attr_reg_t region12_pms_attr;
    volatile hp_apm_region13_addr_start_reg_t region13_addr_start;
    volatile hp_apm_region13_addr_end_reg_t region13_addr_end;
    volatile hp_apm_region13_pms_attr_reg_t region13_pms_attr;
    volatile hp_apm_region14_addr_start_reg_t region14_addr_start;
    volatile hp_apm_region14_addr_end_reg_t region14_addr_end;
    volatile hp_apm_region14_pms_attr_reg_t region14_pms_attr;
    volatile hp_apm_region15_addr_start_reg_t region15_addr_start;
    volatile hp_apm_region15_addr_end_reg_t region15_addr_end;
    volatile hp_apm_region15_pms_attr_reg_t region15_pms_attr;
    volatile hp_apm_func_ctrl_reg_t func_ctrl;
    volatile hp_apm_m0_status_reg_t m0_status;
    volatile hp_apm_m0_status_clr_reg_t m0_status_clr;
    volatile hp_apm_m0_exception_info0_reg_t m0_exception_info0;
    volatile hp_apm_m0_exception_info1_reg_t m0_exception_info1;
    volatile hp_apm_m1_status_reg_t m1_status;
    volatile hp_apm_m1_status_clr_reg_t m1_status_clr;
    volatile hp_apm_m1_exception_info0_reg_t m1_exception_info0;
    volatile hp_apm_m1_exception_info1_reg_t m1_exception_info1;
    volatile hp_apm_m2_status_reg_t m2_status;
    volatile hp_apm_m2_status_clr_reg_t m2_status_clr;
    volatile hp_apm_m2_exception_info0_reg_t m2_exception_info0;
    volatile hp_apm_m2_exception_info1_reg_t m2_exception_info1;
    volatile hp_apm_m3_status_reg_t m3_status;
    volatile hp_apm_m3_status_clr_reg_t m3_status_clr;
    volatile hp_apm_m3_exception_info0_reg_t m3_exception_info0;
    volatile hp_apm_m3_exception_info1_reg_t m3_exception_info1;
    volatile hp_apm_int_en_reg_t int_en;
    volatile hp_apm_clock_gate_reg_t clock_gate;
    uint32_t reserved_110[443];
    volatile hp_apm_date_reg_t date;
} hp_apm_dev_t;

extern hp_apm_dev_t HP_APM;

#ifndef __cplusplus
_Static_assert(sizeof(hp_apm_dev_t) == 0x800, "Invalid size of hp_apm_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
